docker/docker-in-action-notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-08-05 一 20:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>docker in action 笔记</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">docker in action 笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org343daa4">1 什么是 docker</a>
<ul>
<li><a href="#orgcd4405c">1.1 什么是 docker</a></li>
</ul>
</li>
<li><a href="#orgbbef104">2 在容器中运行软件</a></li>
<li><a href="#orga7ea5b1">3 查找和安装软件</a></li>
<li><a href="#org44825eb">4 持久化存储和卷间状态共享</a>
<ul>
<li><a href="#org5e7a9c9">4.1 存储卷提供容器无关的数据管理方式</a></li>
<li><a href="#org37dec56">4.2 存储卷的类型</a>
<ul>
<li><a href="#org5265b79">4.2.1 挂载卷</a></li>
<li><a href="#org485288a">4.2.2 管理卷</a></li>
</ul>
</li>
<li><a href="#org34d880f">4.3 共享存储卷</a>
<ul>
<li><a href="#orgfb024e4">4.3.1 主机依赖间的共享</a></li>
<li><a href="#org51a9023">4.3.2 volumes-from 标志</a></li>
</ul>
</li>
<li><a href="#org4b7a687">4.4 管理卷的生命周期</a>
<ul>
<li><a href="#org6697c75">4.4.1 管理卷的权限</a></li>
<li><a href="#org4b3d624">4.4.2 存储卷的清理</a></li>
</ul>
</li>
<li><a href="#org1b4f926">4.5 存储卷的高级容器模式</a>
<ul>
<li><a href="#orgb92a56c">4.5.1 卷容器模式</a></li>
<li><a href="#org3caf961">4.5.2 数据打包的存储卷容器</a></li>
<li><a href="#org953e3c2">4.5.3 多态容器模式</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org186ad22">5 网络访问</a>
<ul>
<li><a href="#orgf9dce62">5.1 网络相关的背景知识</a></li>
<li><a href="#org9504742">5.2 Docker 的网络</a></li>
<li><a href="#org3bf357b">5.3 Closed 容器</a></li>
<li><a href="#org377048d">5.4 Bridged 容器</a></li>
<li><a href="#org0a4eff9">5.5 Joined 容器</a></li>
<li><a href="#orgfe5eed5">5.6 Open 容器</a></li>
<li><a href="#orgd165a93">5.7 跨容器依赖</a></li>
</ul>
</li>
<li><a href="#org8c30f7d">6 隔离-限制危险</a></li>
<li><a href="#org55e4170">7 从容器构建镜像</a>
<ul>
<li><a href="#orgb789d37">7.1 从容器构建镜像</a></li>
<li><a href="#orga046952">7.2 深入 Docker 镜像和层</a></li>
<li><a href="#org102361a">7.3 导出和导入扁平文件系统</a></li>
<li><a href="#orgdd782e6">7.4 版本控制的最佳实践</a></li>
</ul>
</li>
<li><a href="#org312c138">8 构建自动化和高级镜像设置</a>
<ul>
<li><a href="#orge158681">8.1 使用 Dockerfile 打包 Git</a></li>
<li><a href="#orgce8b919">8.2 Dockerfile 入门</a></li>
<li><a href="#org83da235">8.3 注入下游镜像在构建时发生的操作</a></li>
<li><a href="#org82a8110">8.4 使用启动脚本和多进程容器</a></li>
<li><a href="#org863203e">8.5 加固应用镜像</a></li>
</ul>
</li>
<li><a href="#orge7b0c6e">9 公有和私有软件分发</a></li>
<li><a href="#org07bd90b">10 运行自定义的 registry</a></li>
<li><a href="#org582aa6b">11 docker compose 声明式环境</a></li>
<li><a href="#org69dab5a">12 docker machine 和 swarm 集群</a></li>
<li><a href="#orgff4ba47">其他知识点</a></li>
</ul>
</div>
</div>

<div id="outline-container-org343daa4" class="outline-2">
<h2 id="org343daa4">1 什么是 docker</h2>
<div class="outline-text-2" id="text-org343daa4">
</div>
<div id="outline-container-orgcd4405c" class="outline-3">
<h3 id="orgcd4405c">1.1 什么是 docker</h3>
<div class="outline-text-3" id="text-orgcd4405c">
<p>
docker 包括一个命令行程序，一个后台守护进程，以及一组远程服务。它解决了常见的软件问题，并简化了安装、运行、发布和删除软件。
</p>

<p>
docker 实现隔离的八个方面。
</p>
</div>
</div>
</div>

<div id="outline-container-orgbbef104" class="outline-2">
<h2 id="orgbbef104">2 在容器中运行软件</h2>
<div class="outline-text-2" id="text-orgbbef104">
<p>
帮助容器建立与环境无关系统的三个特定功能：
</p>
<ul class="org-ul">
<li>只读文件系统</li>
<li>环境变量注入</li>
<li>存储卷</li>
</ul>

<p>
Page17 建立邮件程序的命令是： <code>docker run -d --name mailer dockerinaction/ch2_mailer</code>
</p>

<p>
docker logs
</p>

<p>
cid=$(docker create nginx)
</p>

<p>
docker ps -l -q
</p>

<p>
docker rename
</p>

<p>
docker run &#x2013;restart always -e 环境变量
</p>

<p>
docker rm -rm
</p>

<p>
docker rm  -vf $(docker ps -a -q)
</p>
</div>
</div>

<div id="outline-container-orga7ea5b1" class="outline-2">
<h2 id="orga7ea5b1">3 查找和安装软件</h2>
<div class="outline-text-2" id="text-orga7ea5b1">
<p>
docker save -o myfile.tar busybox
</p>

<p>
docker load -i myfile.tart
</p>

<p>
docker build -t &lt;tag&gt; &lt;dockerfile&gt;
</p>

<p>
union 文件系统对文件系统进行了隔离。它的缺点：
</p>
<ul class="org-ul">
<li>在不同文件系统规则间切换可能会有问题。</li>
<li>使用的写时复制的模式使得内存映射文件（mmap（）系统调用）实现困难。</li>
</ul>
</div>
</div>

<div id="outline-container-org44825eb" class="outline-2">
<h2 id="org44825eb">4 持久化存储和卷间状态共享</h2>
<div class="outline-text-2" id="text-org44825eb">
</div>
<div id="outline-container-org5e7a9c9" class="outline-3">
<h3 id="org5e7a9c9">4.1 存储卷提供容器无关的数据管理方式</h3>
<div class="outline-text-3" id="text-org5e7a9c9">
<p>
存储卷是一个数据分割和共享的工具，有一个与容器无关的范围或生命周期。
</p>

<p>
镜像适合打包和分发相对静态的文件，存储卷则持有动态或专门数据。
</p>
</div>
</div>

<div id="outline-container-org37dec56" class="outline-3">
<h3 id="org37dec56">4.2 存储卷的类型</h3>
<div class="outline-text-3" id="text-org37dec56">
<p>
不管哪种存储卷，本质上都是将主机文件系统挂在到容器文件系统中。
</p>
</div>
<div id="outline-container-org5265b79" class="outline-4">
<h4 id="org5265b79">4.2.1 挂载卷</h4>
<div class="outline-text-4" id="text-org5265b79">
<p>
绑定挂载存储卷（简称挂载卷）：使用用户提供主机目录或文件
</p>

<p>
注意：
</p>
<ul class="org-ul">
<li>如果指定主机目录不存在，docker 会自动创建。</li>
<li>绑定的文件必须在主机上存在，否则会被 docker 当成目录创建。</li>
</ul>

<p>
缺点：
</p>
<ul class="org-ul">
<li>将可移植容器绑定到特定主机的文件系统。</li>
<li>创造了与其他容器发生冲突的机会。</li>
</ul>
</div>
</div>

<div id="outline-container-org485288a" class="outline-4">
<h4 id="org485288a">4.2.2 管理卷</h4>
<div class="outline-text-4" id="text-org485288a">
<p>
管理存储卷（简称管理卷）：使用由 Docker 守护进程控制的位置，称为 Docker 管理空间。
</p>
<ul class="org-ul">
<li>可以用来解耦存储卷。</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org34d880f" class="outline-3">
<h3 id="org34d880f">4.3 共享存储卷</h3>
<div class="outline-text-3" id="text-org34d880f">
</div>
<div id="outline-container-orgfb024e4" class="outline-4">
<h4 id="orgfb024e4">4.3.1 主机依赖间的共享</h4>
<div class="outline-text-4" id="text-orgfb024e4">
<p>
多个容器都挂载在主机的同一目录。
</p>
</div>
</div>

<div id="outline-container-org51a9023" class="outline-4">
<h4 id="org51a9023">4.3.2 volumes-from 标志</h4>
<div class="outline-text-4" id="text-org51a9023">
<p>
通过 volumes-from 复制源容器定义的所有键，通过该参数还可以直接或传递地复制卷。
</p>
</div>
</div>
</div>

<div id="outline-container-org4b7a687" class="outline-3">
<h3 id="org4b7a687">4.4 管理卷的生命周期</h3>
<div class="outline-text-3" id="text-org4b7a687">
</div>
<div id="outline-container-org6697c75" class="outline-4">
<h4 id="org6697c75">4.4.1 管理卷的权限</h4>
<div class="outline-text-4" id="text-org6697c75">
<p>
区分存储卷的最好方法是每个管理卷都定义一个容器。
</p>
</div>
</div>

<div id="outline-container-org4b3d624" class="outline-4">
<h4 id="org4b3d624">4.4.2 存储卷的清理</h4>
<div class="outline-text-4" id="text-org4b3d624">
<p>
Docker 守护程序无法删除挂载卷。
</p>

<p>
删除容器时，使用 <code>-v</code> 参数的 <code>docker rm</code> 命令试图删除目标容器中引用的任何管理卷。 <b>删除容器最好带上 <code>-v</code> 参数</b>
</p>

<p>
如果删除每个已引用管理卷的容器，但是没有使用 <code>-v</code> 标志，就会产生孤立卷。移除孤立卷需要手工操作。
</p>
</div>
</div>
</div>

<div id="outline-container-org1b4f926" class="outline-3">
<h3 id="org1b4f926">4.5 存储卷的高级容器模式</h3>
<div class="outline-text-3" id="text-org1b4f926">
</div>
<div id="outline-container-orgb92a56c" class="outline-4">
<h4 id="orgb92a56c">4.5.1 卷容器模式</h4>
<div class="outline-text-4" id="text-orgb92a56c">
<p>
卷容器： <b>只提供卷句柄的容器</b> 。卷容器停止时仍能保证存储卷的引用。
</p>

<p>
使用卷容器要求能控制并使挂载点的命名管理标准化。
</p>
</div>
</div>

<div id="outline-container-org3caf961" class="outline-4">
<h4 id="org3caf961">4.5.2 数据打包的存储卷容器</h4>
<div class="outline-text-4" id="text-org3caf961">
<p>
用来将 <b>镜像中的</b> 静态内容复制到 <b>其定义的存储卷</b> 。（注意方向）这些容器可用于分发关键架构信息，如配置，秘钥材料和代码。这是多态容器模式的基础。
</p>
</div>
</div>

<div id="outline-container-org953e3c2" class="outline-4">
<h4 id="org953e3c2">4.5.3 多态容器模式</h4>
<div class="outline-text-4" id="text-org953e3c2">
<p>
将文件注入静态容器（例如程序）来改变所有类型的行为。
</p>

<p>
可以通过将 openresty-develop-framework 做成一个 docker 镜像，然后将具体的业务代码做成数据打包的存储卷容器，二者结合实现具体的不同业务。
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org186ad22" class="outline-2">
<h2 id="org186ad22">5 网络访问</h2>
<div class="outline-text-2" id="text-org186ad22">
<p>
容器和主机的网络访问主要包括：
</p>
<ul class="org-ul">
<li>单主机网络
<ul class="org-ul">
<li>容器和主机</li>
<li>容器和主机网络</li>
<li>容器和容器</li>
</ul></li>
<li>多主机网络</li>
</ul>
</div>

<div id="outline-container-orgf9dce62" class="outline-3">
<h3 id="orgf9dce62">5.1 网络相关的背景知识</h3>
<div class="outline-text-3" id="text-orgf9dce62">
<p>
Docker 创建了一种虚拟网络，称之为网桥，目的是让所有正在运行的容器能够连接到主机网络。
</p>
</div>
</div>

<div id="outline-container-org9504742" class="outline-3">
<h3 id="org9504742">5.2 Docker 的网络</h3>
<div class="outline-text-3" id="text-org9504742">
<p>
每隔容器都各自拥有一个本地回环接口和一个分离的以太网接口，其中以太网接口连接着 <b>主机命名空间</b> 上的 <b>另外一个虚拟接口</b> （注意不是直接和 docker0 连接）。这两个互连的接口在主机网络栈和每个容器的网络栈之间建立了连接。
</p>

<p>
docker 用内核命名空间来创建这些所有的虚拟接口，但是命名空间本身并不提供网络的隔离。网络暴露或者隔离是通过主机的防火墙规则实现的。
</p>
</div>
</div>


<div id="outline-container-org3bf357b" class="outline-3">
<h3 id="org3bf357b">5.3 Closed 容器</h3>
</div>

<div id="outline-container-org377048d" class="outline-3">
<h3 id="org377048d">5.4 Bridged 容器</h3>
<div class="outline-text-3" id="text-org377048d">
<p>
所有连接到 docker0 接口的虚拟接口都是同一虚拟子网的一部分分。这意味着它们能够互相通信，并且能够通过 docker0 接口和外部的网络进行通信。
</p>

<p>
使用 <code>--hostname</code> 自定义容器的主机名。这个选项会在容器的 DNS 覆盖系统（如/etc/hosts）中添加一条记录。
</p>

<p>
使用 <code>--dns</code> 指定 DNS 服务器。
</p>

<p>
使用 <code>--dns-search</code> 指定 dns 查找域。指定默认的查找后缀，比如公司的外网机器的默认域名。
</p>

<p>
使用 <code>--add-host</code> 用来覆盖 dns 系统查找记录。可以在 mock 第三方接口的时候用到。
</p>

<p>
修改网桥的配置，可以用来配置 IP 测试环境。
</p>
</div>
</div>

<div id="outline-container-org0a4eff9" class="outline-3">
<h3 id="org0a4eff9">5.5 Joined 容器</h3>
<div class="outline-text-3" id="text-org0a4eff9">
<p>
如果其中一个容器的进程需要与另外一个进程在一个未开放的端口上进行通信，最佳的方式就是链接这两个容器。
</p>

<p>
使用场景：
</p>
<ul class="org-ul">
<li>当想要不同的容器上的程序通过本地回环地址进行通信时</li>
<li>当一个容器的程序想要改变 joined 网络栈，而另外一个程序正好需要改变的网络栈</li>
<li>想要监控另外一个程序中某个程序的网络流量。</li>
</ul>
</div>
</div>

<div id="outline-container-orgfe5eed5" class="outline-3">
<h3 id="orgfe5eed5">5.6 Open 容器</h3>
</div>

<div id="outline-container-orgd165a93" class="outline-3">
<h3 id="orgd165a93">5.7 跨容器依赖</h3>
<div class="outline-text-3" id="text-orgd165a93">
<p>
链接（ <code>--link</code> ）的本质是静态的、具有方向性和无传递性的网络依赖。注意：方向性是指服务发现，而不是通信。
</p>
</div>
</div>
</div>

<div id="outline-container-org8c30f7d" class="outline-2">
<h2 id="org8c30f7d">6 隔离-限制危险</h2>
<div class="outline-text-2" id="text-org8c30f7d">
<p>
对 docker 使用宿主机资源的限制
</p>

<p>
对 docker 账号，组的隔离。
</p>
</div>
</div>

<div id="outline-container-org55e4170" class="outline-2">
<h2 id="org55e4170">7 从容器构建镜像</h2>
<div class="outline-text-2" id="text-org55e4170">
</div>
<div id="outline-container-orgb789d37" class="outline-3">
<h3 id="orgb789d37">7.1 从容器构建镜像</h3>
</div>

<div id="outline-container-orga046952" class="outline-3">
<h3 id="orga046952">7.2 深入 Docker 镜像和层</h3>
</div>

<div id="outline-container-org102361a" class="outline-3">
<h3 id="org102361a">7.3 导出和导入扁平文件系统</h3>
</div>

<div id="outline-container-orgdd782e6" class="outline-3">
<h3 id="orgdd782e6">7.4 版本控制的最佳实践</h3>
</div>
</div>

<div id="outline-container-org312c138" class="outline-2">
<h2 id="org312c138">8 构建自动化和高级镜像设置</h2>
<div class="outline-text-2" id="text-org312c138">
</div>
<div id="outline-container-orge158681" class="outline-3">
<h3 id="orge158681">8.1 使用 Dockerfile 打包 Git</h3>
<div class="outline-text-3" id="text-orge158681">
<p>
特定的空镜像:scratch。
</p>

<p>
docker build 的-f 参数只能设置文件名字，不能设置文件位置。
</p>

<p>
Dockerfile 中 每个指令都会创建一个新容器，然后做指定的修改，当修改完成后，构建程序会提交新容器，然后以同样的方式执行下一条指令。
</p>
</div>
</div>

<div id="outline-container-orgce8b919" class="outline-3">
<h3 id="orgce8b919">8.2 Dockerfile 入门</h3>
<div class="outline-text-3" id="text-orgce8b919">
<p>
Dockerfile 可以简化将文件复制从计算机复制到镜像的过程。启动新项目第一件事情应该使用 <code>.dockerignore</code> 指定不需要复制到镜像中的文件。
</p>

<p>
每个 Dockerfile 指令都会导致一个新层被创建，指令应该尽可能合并，因为构建程序不会进行任何优化。
</p>

<p>
使用 exec 格式是最佳实践。
</p>

<p>
CMD 指令表示入口点的一个参数列表。
</p>

<p>
ADD 指令类似 COPY 指令，不同点在于：
</p>
<ul class="org-ul">
<li>如果指定一个 url，会拉取远程源文件。（不是好的实践，因无法清理）</li>
<li>会将判定位存档文件的源中的文件提取出来。</li>
</ul>
</div>
</div>

<div id="outline-container-org83da235" class="outline-3">
<h3 id="org83da235">8.3 注入下游镜像在构建时发生的操作</h3>
<div class="outline-text-3" id="text-org83da235">
<p>
ON_BUILD 指令。
</p>
</div>
</div>

<div id="outline-container-org82a8110" class="outline-3">
<h3 id="org82a8110">8.4 使用启动脚本和多进程容器</h3>
</div>

<div id="outline-container-org863203e" class="outline-3">
<h3 id="org863203e">8.5 加固应用镜像</h3>
</div>
</div>

<div id="outline-container-orge7b0c6e" class="outline-2">
<h2 id="orge7b0c6e">9 公有和私有软件分发</h2>
</div>

<div id="outline-container-org07bd90b" class="outline-2">
<h2 id="org07bd90b">10 运行自定义的 registry</h2>
</div>

<div id="outline-container-org582aa6b" class="outline-2">
<h2 id="org582aa6b">11 docker compose 声明式环境</h2>
</div>

<div id="outline-container-org69dab5a" class="outline-2">
<h2 id="org69dab5a">12 docker machine 和 swarm 集群</h2>
</div>

<div id="outline-container-orgff4ba47" class="outline-2">
<h2 id="orgff4ba47">其他知识点</h2>
<div class="outline-text-2" id="text-orgff4ba47">
<ul class="org-ul">
<li>LXC</li>
<li>cgroup</li>
<li>chroot</li>
<li>union 文件系统</li>
<li>MNT 命名空间</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2019-08-05 一 20:28</p>
<p class="validation"></p>
</div>
</body>
</html>
